webservice.wsdl

<?xml version='1.0' encoding='UTF-8'?><wsdl:definitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://cxf.app.io/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns2="http://schemas.xmlsoap.org/soap/http" xmlns:ns1="http://soap.app.io/" name="HelloWorld" targetNamespace="http://cxf.app.io/">
  <wsdl:import location="http://localhost:8080/soap/hw?wsdl=HelloWorld.wsdl" namespace="http://soap.app.io/">
    </wsdl:import>
  <wsdl:binding name="HelloWorldSoapBinding" type="ns1:HelloWorld">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="getUsers">
      <soap:operation soapAction="" style="document"/>
      <wsdl:input name="getUsers">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="getUsersResponse">
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="sayHi">
      <soap:operation soapAction="" style="document"/>
      <wsdl:input name="sayHi">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="sayHiResponse">
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="securedHiToUser">
      <soap:operation soapAction="" style="document"/>
      <wsdl:input name="securedHiToUser">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="securedHiToUserResponse">
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="sayHiToUser">
      <soap:operation soapAction="" style="document"/>
      <wsdl:input name="sayHiToUser">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="sayHiToUserResponse">
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="hello">
      <soap:operation soapAction="" style="document"/>
      <wsdl:input name="hello">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="helloResponse">
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="HelloWorld">
    <wsdl:port binding="tns:HelloWorldSoapBinding" name="HelloWorldImplPort">
      <soap:address location="http://localhost:8080/soap/hw"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
